app/controllers/sessions_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 LIMIT $3  [["uid", "110272316266962061614"], ["provider", "google_oauth2"], ["LIMIT", 1]]
---
    def omniauth
        # binding.pry
        user = User.find_or_create_by(uid: request.env['omniauth.auth'][:uid] , provider: request.env['omniauth.auth'][:provider]) do |u|