app/controllers/users_controller.rb

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def edit
        # byebug
        users = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "ádsfsd "], ["email", "ádsfsd "], ["updated_at", "2023-07-04 06:34:50.305511"], ["id", 59]]

    def destroy
        @user = User.find(params[:id])

        if @user.present?
          @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 62]]